from Project import db
import datetime
def checkType(payload):
    if 'message' in payload['events'][0].keys():
        message_type = payload['events'][0]['message']['type']
    elif 'postback' in payload['events'][0].keys():
        message_type = 'postback'
    else:
        message_type = 'else'
    return message_type


def defineSender(sender, profile):
    doc_ref = db.collection(u'users').document(sender)
    doc = doc_ref.get()
    if doc.exists:
        doc_ref.update({'pictureUrl': profile.picture_url, 'display_name': profile.display_name,'userId':sender,
                       'last_message': datetime.datetime.timestamp(datetime.datetime.now())})

    else:
        obj = {'pictureUrl': profile.picture_url, 'display_name': profile.display_name,'userId':sender,
               'last_message': datetime.datetime.timestamp(datetime.datetime.now()), 'subState': 'none','mainState':'none','profile':False,'symptom':False,'score':0,'subStateTH':'none'}
        doc_ref.set(obj)

def medHandler(medName):
    if medName == 'betamethasone':
        return {"message":"Betamethasone (เบต้าเมทาโซน) เป็นยาในกลุ่มคอร์ติโคสเตียรอยด์ มีฤทธิ์รักษาภาวะต่าง ๆ จากการอักเสบ เช่น อาการแพ้ โรคสะเก็ดเงิน และผื่นผิวหนัง ยา Betamethasone มีข้อควรระวังในการใช้ยามากมาย ผู้ป่วยควรอ่านฉลากยาอย่างละเอียด และปรึกษาแพทย์หรือเภสัชกรให้ดีก่อนใช้ยาเสมอ\n\nกลุ่มยา: คอร์ติโคสเตียรอยด์\nประเภทยา: ยาตามใบสั่งแพทย์\nสรรพคุณ: ต้านการอักเสบ\nกลุ่มผู้ป่วย: ผู้ใหญ่\nรูปแบบของยา: ยาทาภายนอก\n\nรายละเอียดเพิ่มเติม: https://www.pobpad.com/betamethasone"}
    elif medName == 'clobetasol':
        return {"message":"Clobetasol (โคลเบทาซอล) เป็นยาคอร์ติโคสเตียรอยด์ชนิดใช้เฉพาะที่ นำมาใช้รักษาโรคผิวหนังที่ตอบสนองต่อยาสเตียรอยด์ (Corticosteroid-Responsive Dermatoses) เช่น การระคายเคือง ผื่นคัน ผิวหนังอักเสบ และอาการแพ้ทางผิวหนัง นอกจากนี้ ยังอาจใช้รักษาโรคอื่น ๆ ตามดุลยพินิจของแพทย์\n\nกลุ่มยา: ยาคอร์ติโคสเตียรอยด์ชนิดใช้เฉพาะที่\nประเภทยา: ยาตามใบสั่งแพทย์\nสรรพคุณ: \tรักษาภาวะทางผิวหนังที่ตอบสนองต่อยาสเตียรอยด์\nกลุ่มผู้ป่วย: เด็ก ผู้ใหญ่\nรูปแบบของยา: ยาใช้เฉพาะที่ชนิดยาขี้ผึ้ง ครีม โลชั่น เจล โฟม แชมพู และสารละลายที่ใช้กับหนังศีรษะ\n\nรายละเอียดเพิ่มเติม: https://www.pobpad.com/clobetasol-โคลเบทาซอล"}
    elif medName == 'topicorte':
        return {"message":"เดสออกซิเมทาโซน (Desoximetasone) เป็นยาในกลุ่มคอร์ติโคสเตอรอยด์ (Corticosteroids) ใช้กับโรคผิวหนังที่ไม่ได้เกิดจากการติดเชื้อ เช่น ผื่นแพ้อักเสบ, โรคผิวหนังที่เกิดจากสารระคายเคืองหรือผื่นภูมิแพ้, อาการอักเสบผิวหนังของโรคสะเก็ดเงิน และผิวไหม้เนื่องจากแสงแดด เป็นต้น\n\nกลุ่มยา: ยาคอร์ติโคสเตียรอยด์\nประเภทยา: ยาตามใบสั่งแพทย์\nสรรพคุณ: \tรักษาภาวะทางผิวหนังที่ตอบสนองต่อยาสเตียรอยด์\nกลุ่มผู้ป่วย: เด็ก ผู้ใหญ่ ผู้สูงอายุ\nรูปแบบของยา: ยาใช้เฉพาะที่ชนิดยาขี้ผึ้ง ครีม \n\nรายละเอียดเพิ่มเติม: https://healthythai.online/drug/desoximetasone (topical)/"}
    elif medName == 'hydrocortisone':
        return {"message":"Hydrocortisone (ไฮโดรคอร์ติโซน) เป็นยาสเตียรอยด์ที่ใช้รักษาการอักเสบตามอวัยวะต่าง ๆ เช่น ผิวหนัง และรักษาโรคภูมิแพ้ โรคหืด โรคเกี่ยวกับต่อมไทรอยด์ ข้ออักเสบ ลำไส้ใหญ่อักเสบ โรคสะเก็ดเงิน โรคไต โรคภูมิคุ้มกันทำลายตนเองอย่างโรคลูปัส และรักษาผู้ที่ต่อมหมวกไตไม่สามารถผลิตสารไฮโดรคอร์ติโซนได้ตามปริมาณปกติ หรืออาจใช้รักษาโรคอื่น ๆ นอกเหนือจากนี้ตามดุลยพินิจของแพทย์\n\nกลุ่มยา: ยาคอร์ติโคสเตียรอยด์\nประเภทยา: ยาตามใบสั่งแพทย์\nสรรพคุณ: \tรักษาการอักเสบ\nกลุ่มผู้ป่วย: เด็ก ผู้ใหญ่ \nรูปแบบของยา: ยารับประทาน ยาทาเฉพาะที่ ยาฉีด\n\nรายละเอียดเพิ่มเติม: https://www.pobpad.com/hydrocortisone"}
    elif medName =='prednisolone':
        return {"message":"เพรดนิโซโลน / เพร็ดนิโซโลน (Prednisolone) หรือยาที่คนทั่วไปรู้จักในชื่อทางการค้าว่า เพรดโซเมด (Predsomed) เป็นยาในกลุ่มคอร์ติโคสเตียรอยด์ (Corticosteroids) หรือยาสเตียรอยด์ (Steroids) ยานี้เป็นสารสังเคราะห์ซึ่งคล้ายกับฮอร์โมนตามธรรมชาติที่ผลิตขึ้นในร่างกายโดยต่อมหมวกไต ถูกนำมาใช้ในทางการแพทย์เพื่อรักษาโรคและภาวะผิดปกติหลายอย่าง เช่น ต้านการอักเสบ รักษาอาการแพ้ กดภูมิคุ้มกัน รวมทั้งรักษาความผิดปกติเกี่ยวกับระบบต่าง ๆ เช่น ระบบกล้ามเนื้อ กระดูก ข้อ\n เป็นต้น\n\nกลุ่มยา: ยาคอร์ติโคสเตียรอยด์\nประเภทยา: ยาตามใบสั่งแพทย์\nสรรพคุณ: \tรักษาการอักเสบ\nกลุ่มผู้ป่วย: เด็ก ผู้ใหญ่ \nรูปแบบของยา: ยาครีมชนิดทา ขนาดความเข้มข้น 0.5%\n\nรายละเอียดเพิ่มเติม: https://medthai.com/%E0%B9%80%E0%B8%9E%E0%B8%A3%E0%B8%94%E0%B8%99%E0%B8%B4%E0%B9%82%E0%B8%8B%E0%B9%82%E0%B8%A5%E0%B8%99/"}
    elif medName =='triamcinolone':
        return {"message":"Triamcinolone (ไตรแอมซิโนโลน) เป็นยากลุ่มคอร์ติโคสเตียรอยด์ที่มีคุณสมบัติต้านการอักเสบ ใช้รักษาโรคภูมิแพ้ โรคข้ออักเสบ โรคลำไส้ใหญ่อักเสบ โรคสะเก็ดเงิน โรคลูปัส โรคผิวหนัง และโรคเกี่ยวกับการหายใจ หรืออาจใช้รักษาโรคอื่น ๆ ตามดุลยพินิจของแพทย์\n\nกลุ่มยา: ยาคอร์ติโคสเตียรอยด์\nประเภทยา: ยาตามใบสั่งแพทย์\nสรรพคุณ: \tรักษาการอักเสบ\nกลุ่มผู้ป่วย: ผู้ใหญ่และเด็ก\nรูปแบบของยา: ยารับประทาน ยาทาเฉพาะที่ ยาฉีด\n\nรายละเอียดเพิ่มเติม: https://medthai.com/เพรดนิโซโลน/"}
    elif medName =='fluticasone':
        return {"message":"ฟลูโอซิโนโลนชนิดใช้กับผิวหนัง (topical fluocinolone) เป็นยาในกลุ่มคอร์ติโคสเตอรอยด์ (corticosteroids) หรืออาจเรียกสั้น ๆ ว่า สเตอรอยด์ หรือ สเตียรอยด์ อยู่ในรูปแอซีโทไนด์เอสเทอร์ (acetonide ester) ใช้สำหรับต้านการอักเสบ แก้คันที่ผิวหนัง เช่น ใช้บรรเทาอาการอักเสบผิวหนังของโรคสะเก็ดเงิน และโรคผิวหนังชนิดต่าง ๆ ที่ตอบสนองต่อคอร์ติโคสเตอรอยด์\n\nกลุ่มยา: ยาคอร์ติโคสเตียรอยด์\nประเภทยา: ยาตามคำแนะนำแพทย์\nสรรพคุณ: ต้านการอักเสบ แก้คันที่ผิวหนัง\nกลุ่มผู้ป่วย: เด็ก ผู้ใหญ่ ผู้สูงอายุ\nรูปแบบของยา: ยาทาเฉพาะที่\n\nรายละเอียดเพิ่มเติม: https://healthythai.online/drug/fluocinolone acetonide (topical)/"}
    elif medName == 'mometasone':
        return {"message":"Elomet เป็นยาทาคอร์ติโคสเตียรอยด์ ที่มีความเข้มข้นปานกลาง ใช้สำหรับบรรเทาอาการคัน อักเสบของผิวหนังซึ่งไม่เกี่ยวข้องกับการติดเชื้อที่ตอบสนองต่อคอร์ติโคสเตียรอยด์ เช่น โรคสะเก็ดเงิน และ atopic dermatitis โดยทายาบางๆลงบนผิวหนังที่เป็น วันละ 1 ครั้ง จนรอยโรคหาย อาการที่พบบ่อยคือ  ผิวแห้ง ระคายเคือง ขนขึ้น ผิวหนังซีดขาว  ห้ามใช้ยานี้กับเด็กที่อายุต่ำกว่า 2 ปี และห้ามใช้ยาระยะเวลานานเกินคำสั่งแพทย์\n\nกลุ่มยา: ยาคอร์ติโคสเตียรอยด์\nประเภทยา: ยาตามใบสั่งแพทย์\nสรรพคุณ: \tบรรเทาอาการคัน อักเสบของผิวหนัง\nกลุ่มผู้ป่วย: ห้ามใช้ยานี้กับเด็กที่อายุต่ำกว่า 2 ปี\nรูปแบบของยา: ยาใช้ภายนอก ชนิดครีมทาผิวหนัง\n\nรายละเอียดเพิ่มเติม: https://hdmall.co.th/pharmacies-chat/elomet-cream-15g-01"}
    elif medName =='prednicarbate':
        return {"message":"เพรดนิคาร์เบต (prednicarbate) เป็นยาในกลุ่มคอร์ติโคสเตอรอยด์ (corticosteroids) มีฤทธิ์ลดอาการอักเสบและการแพ้เช่น อาการระคายเคือง บวม แดง คัน ใช้กับผิวหนัง (topical prednicarbate) ใช้กับโรคผิวหนังที่ไม่ได้เกิดจากการติดเชื้อ เช่น ผิวหนังอักเสบแบบเอ็คซีม่า (eczematoid dermatitis), โรคผิวหนังที่เกิดจากสารระคายเคือง หรือผื่นภูมิแพ้, อาการอักเสบผิวหนังของโรคสะเก็ดเงิน และผิวไหม้เนื่องจากแสงแดด หรือโรคผิวหนังชนิดอื่น ๆ ที่ตอบสนองต่อยาสเตอรอยด์ เป็นต้น\n\nกลุ่มยา: ยาคอร์ติโคสเตียรอยด์\nประเภทยา: ยาตามคำแนะนำแพทย์\nสรรพคุณ: \tลดอาการอักเสบและการแพ้\nกลุ่มผู้ป่วย: เด็ก ผู้ใหญ่ \nรูปแบบของยา: ยาครีมชนิดทา ขนาดความเข้มข้น 0.1%\n\nรายละเอียดเพิ่มเติม: https://healthythai.online/drug/prednicarbate%20(topical)/"}
    elif medName == 'fluocinonide':
        return {"message":"ฟลูโอซิโนโลนชนิดใช้กับผิวหนัง (topical fluocinolone) เป็นยาในกลุ่มคอร์ติโคสเตอรอยด์ (corticosteroids) หรืออาจเรียกสั้น ๆ ว่า สเตอรอยด์ หรือ สเตียรอยด์ อยู่ในรูปแอซีโทไนด์เอสเทอร์ (acetonide ester) ใช้สำหรับต้านการอักเสบ แก้คันที่ผิวหนัง เช่น ใช้บรรเทาอาการอักเสบผิวหนังของโรคสะเก็ดเงิน และโรคผิวหนังชนิดต่าง ๆ ที่ตอบสนองต่อคอร์ติโคสเตอรอยด์\n\nกลุ่มยา: ยาคอร์ติโคสเตียรอยด์\nประเภทยา: ยาตามคำแนะนำแพทย์\nสรรพคุณ: ต้านการอักเสบ แก้คันที่ผิวหนัง\nกลุ่มผู้ป่วย: เด็ก ผู้ใหญ่ ผู้สูงอายุ\nรูปแบบของยา: ยาทาเฉพาะที่\n\nรายละเอียดเพิ่มเติม: https://healthythai.online/drug/fluocinolone acetonide (topical)/"}
    elif medName == 'clotrimazole':
        return {"message":"Clotrimazole (โคลไตรมาโซล) เป็นยาต้านเชื้อราที่ใช้รักษาการติดเชื้อราตามอวัยวะต่าง ๆ เช่น ผิวหนัง ปาก และช่องคลอด รวมไปถึงรักษาโรคกลาก โรคน้ำกัดเท้า หรืออาจนำมาใช้รักษาโรคอื่น ๆ นอกเหนือจากนี้ตามดุลยพินิจของแพทย์\n\nกลุ่มยา: ยาต้านเชื้อรา\nประเภทยา: ยาตามใบสั่งแพทย์ \nสรรพคุณ: รักษาการติดเชื้อรา\nกลุ่มผู้ป่วย: ผู้ใหญ่\nรูปแบบของยา: ยาอม, ยาทาเฉพาะที่, ยาเหน็บช่องคลอด\n\nอ่านเพิ่มเติม https://www.pobpad.com/clotrimazole\n"}
    elif medName == 'ketoconazole':
        return {"message":"Ketoconazole (คีโตโคนาโซล ) คือ ยาที่รักษาการติดเชื้อราในร่างกายและที่ผิวหนัง เช่น เชื้อราในเลือด เชื้อราในปอด กลาก เกลื้อน เชื้อราในช่องคลอด หรือรังแค โดยสารต้านเชื้อรานั้นจะกำจัดเชื้อราที่เป็นสาเหตุของการติดเชื้อพร้อมกับป้องกันไม่ให้เกิดขึ้นใหม่ ซึ่งจะมียาที่เราพบได้ทั่วไปตามร้านขายยาจะเป็นรูปแบบใช้ทาภายนอก เช่น ครีมทาผิวหนัง แชมพูขจัดรังแค และสถานพยาบาลจะเป็นยาเม็ดสำหรับรับประทาน\n\nกลุ่มยา: ยาต้านเชื้อรา\nประเภทยา: ยาตามใบสั่งแพทย์\nสรรพคุณ: รักษาโรคจากเชื้อรา\nกลุ่มผู้ป่วย: เด็กและผู้ใหญ่\nรูปแบบของยา: ยาเม็ด, ยาทา, แชมพู\n\nอ่านเพิ่มเติม https://www.pobpad.com/คีโตโคนาโซล/\n"}
    elif medName == 'tonaf':
        return {"message":"Tonaf Cream (ครีมโทนาฟ) มีตัวยาต้านเชื้อรา Tolnaftate ซึ่งเป็นสารเคมีสังเคราะห์ประเภทไทโอคาร์บาเมท (Thiocarbamate, สารเคมีชนิดหนึ่งที่มีกำมะถันเป็นส่วนประกอบ) ถูกนำมาใช้เป็นยาต้าน/ฆ่าเชื้อราที่ผิวหนัง ให้ผลในการรักษาโรคผิวหนังที่เกิดจากเชื้อรา กลากเกลื้อน คันตามนิ้วมือนิ้วเท้า คันในร่มผ้า ฮ่องกงฟุต น้ำกัดเท้า เชื้อราบนหนังศีรษะ รังแค\n\nกลุ่มยา: ยาต้านเชื้อรา\nประเภทยา: ยาตามใบสั่งแพทย์\nสรรพคุณ:\tรักษาโรคจากเชื้อรา\nกลุ่มผู้ป่วย:  เด็กและผู้ใหญ่\nรูปแบบของยา:  ยาครีม\n\nอ่านเพิ่มเติม  https://hdmall.co.th/pharmacies-chat/tonaf-cream-tolnaftate-cream-1-w-w-tonaf-fungus-packing-packing-size-5-grams-tube\n"}
    elif medName == 'miconazole':
        return {"message":"Miconazole (ไมโคนาโซล) เป็นยาต้านเชื้อราในกลุ่มเอโซล ใช้ป้องกันการเจริญเติบโตของเชื้อราและรักษาการติดเชื้อราบริเวณผิวหนัง อย่างน้ำกัดเท้า สังคัง กลาก และเกลื้อน รวมถึงรักษาการติดเชื้อจากยีสต์ในช่องคลอด หรืออาจนำมาใช้รักษาอาการอื่น ๆ ตามดุลยพินิจของแพทย์ด้วย  \n\nกลุ่มยา: ยาต้านเชื้อราในกลุ่มเอโซล (Azole Antifungals)\nประเภทยา: ยาตามใบสั่งแพทย์ ยาที่หาซื้อได้เอง\nสรรพคุณ: ป้องกันการเจริญเติบโตของเชื้อรา และรักษาการติดเชื้อราที่ผิวหนังหรือช่องคลอด\nกลุ่มผู้ป่วย: ผู้ใหญ่, เด็ก\nรูปแบบของยา: ยารับประทาน ยาทาเฉพาะที่ ยาเหน็บช่องคลอด\n\nอ่านเพิ่มเติม https://www.pobpad.com/miconazole-ไมโคนาโซล-2\n"}